# 6. Дано натуральное число N. Приписать по единице в начало и в конец  записи числа N и вывести на экран
# (аналогично, нужно число!)

n = int(input())
n = str(n)
print(int("1" + n + "1"))